{
  "jobs": [
    {
      "account": "Peter",
      "category": [
        "HTML",
        "CSS",
        "JavaScript",
        "Bootstrap",
        "PHP",
        "Node.js",
        "MERN"
      ],
      "company_name": "Amzon",
      "contact_number": "9873214561",
      "content": "HTML, CSS, JavaScript, Bootstrap, PHP, Node.js, MERN",
      "country": "America",
      "description": "Full stack web Developers\r\nFull stack web developers have the ability to design complete web applications and websites. They work on the frontend, backend, database and debugging of web applications or websites.\r\n\r\nTechnology Related to Full Stack Development\r\n--> Front-end Development\r\nIt is the visible part of website or web application which is responsible for user experience. The user directly interacts with the front end portion of the web application or website.\r\n\r\n--> Back-end Development\r\nIt refers to the server-side development of web application or website with a primary focus on how the website works. It is responsible for managing the database through queries and APIs by client-side commands. This type of website mainly consists of three parts front end, back end, and database.\r\nThe back end portion is built by using some libraries, frameworks, and languages.",
      "email": "amazon@gmail.com",
      "id": 1,
      "link": "https://www.amazon.com",
      "location": "Washigton",
      "recruiter": "Peter",
      "title": "Full stack developer"
    },
    {
      "account": "Peter",
      "category": [
        "Technical writing",
        "Data collection and analysis",
        "Field experience with clients",
        "Communication skills",
        "Collaboration skills"
      ],
      "company_name": "Google",
      "contact_number": "954768231",
      "content": "Technical writing, Data collection and analysis, Field experience with clients, Communication skills, Collaboration skills",
      "country": "Germany",
      "description": "Marketing engineers are an essential part of a company’s marketing team because they apply technical knowledge to sales and marketing campaigns. They help internal sales teams and external clients understand the technical aspects of a product. This is a full-time position that requires both technical acumen and excellent communication skills. Marketing engineers usually report to marketing managers and spend most of their time in the office. However, they may also travel to meet with clients as needed.\r\n\r\nMarketing Engineer Duties and Responsibilities:\r\nMarketing engineers’ duties and responsibilities are largely dependent on the industry in which they work, but the job has a few core responsibilities that stay constant no matter the industry. These duties are usually assigned to marketing engineers:\r\nHold Instructional Demonstrations\r\nSupport Sales and Marketing Efforts\r\nCreate Technical Documentation\r\nTrain Marketing Staff\r\nResearch Competitor Products",
      "email": "googlemarketing@gmail.com",
      "id": 2,
      "link": "https://www.googlemarketing.com",
      "location": "Berlin",
      "recruiter": "Peter",
      "title": "Marketing Engineer"
    },
    {
      "account": "Ronald",
      "category": [
        "Python",
        "Java",
        "Scala",
        "Experience with big data",
        "MySQL",
        "PostgreSQL",
        "MongoDB",
        "Cassandra",
        "Strong problem-solving and analytical skills",
        "Excellent communication and collaboration abilities",
        "Familiarity with data integration and ETL tools",
        "Talend",
        "Informatica",
        "Apache NiFi"
      ],
      "company_name": "Microsoft",
      "contact_number": "978546312",
      "content": "Python, Java, Scala, Experience with big data, MySQL, PostgreSQL, MongoDB, Cassandra, Strong problem-solving and analytical skills,\r\nExcellent communication and collaboration abilities, Familiarity with data integration and ETL tools, Talend, Informatica, Apache NiFi",
      "country": "USA",
      "description": "A data engineer is a vital member of any data-driven organization, responsible for designing, building, and maintaining the systems and infrastructure that enable the processing, collection, storage, and analysis of large volumes of data.\r\nThey work closely with business analysts, data scientists, and other stakeholders to ensure that data is clean, accurate, and readily available for analysis, helping business owners make informed decisions and optimize their operations.\r\n\r\nA data engineer's primary role is to create and maintain data pipelines that facilitate data flow from various sources to the data warehouse or other storage systems.\r\nThey are responsible for creating and implementing scalable data architectures, developing and optimizing ETL (Extract, Transform, Load) processes, and ensuring data quality and integrity.\r\n\r\nThe most common data engineer roles include:\r\nData architect\r\nETL developer\r\nData quality engineer\r\nData security engineer\r\nLead data engineer",
      "email": "microsoft.dataenginers@gmail.com",
      "id": 3,
      "link": "https://www.microsoftdataenginers.com",
      "location": "New York",
      "recruiter": "Ronald",
      "title": "Data Engineers"
    },
    {
      "account": "Ronald",
      "category": [
        "Proficiency in statistical analysis and data manipulation",
        "Strong knowledge of data analysis tools",
        "such as Excel",
        "SQL",
        "Python",
        "R",
        "or similar",
        "Giving attention to detail for data accuracy",
        "Problem-solving and critical-thinking abilities",
        "High-level written and verbal communication skills",
        "Experience in handling large data sets and relational databases"
      ],
      "company_name": "Enterprise",
      "contact_number": "8080283122",
      "content": "Proficiency in statistical analysis and data manipulation, Strong knowledge of data analysis tools, such as Excel, SQL, Python, R, or similar, Giving attention to detail for data accuracy, Problem-solving and critical-thinking abilities, High-level written and verbal communication skills, Experience in handling large data sets and relational databases",
      "country": "India",
      "description": "In the era of big data, the role of a data analyst has become increasingly crucial across various industries. A well-crafted data analyst job description is essential for attracting the right talent capable of navigating the complexities of data to disclose trends, patterns, and predictions that lie hidden within.\r\nData Analysts collect, clean, and analyze data sets to solve problems and answer questions. They manage information on sales, market research, logistics, and other areas, significantly enhancing business value by interpreting data and presenting it clearly. Their work is crucial for understanding operations, customer behavior, and market trends, leading to better strategies and results.\r\n\r\nAnalyzing data typically goes through Six phases:\r\nProblem Definition – Understanding the Objective\r\nData Collection – Gathering Data from various sources.\r\nData Cleaning – Cleaning the Data and preparing it for analysis.\r\nData Analysis – Using Statistical Analysis to present findings understandably.\r\nData Visualization – Make Data Presentable by using different-different graphs, charts and more.\r\nInterpretation and Communication – The result is communicated to the respective stakeholders.",
      "email": "enterprise@gmail.com",
      "id": 4,
      "link": "https://www.enterprise.com",
      "location": "Mumbai",
      "recruiter": "Ronald",
      "title": "Data Engineers"
    },
    {
      "account": "Ronald",
      "category": [
        "Java",
        "Python",
        "C++",
        "HTML",
        "CSS",
        "JavaScript",
        "SQL",
        "NoSQL",
        "Spring",
        "Django",
        "Problem-solving and Analytical Skills",
        "Communication and Team Collaboration",
        "Continuous Integration and Deployment (CI/CD)",
        "Understanding of Software Design Patterns",
        "Agile Methodologies"
      ],
      "company_name": "TATA",
      "contact_number": "935261478",
      "content": "Java, Python, C++, HTML, CSS, JavaScript, SQL, NoSQL, Spring, Django, Problem-solving and Analytical Skills, Communication and Team Collaboration, Continuous Integration and Deployment (CI/CD), Understanding of Software Design Patterns, Agile Methodologies",
      "country": "India",
      "description": "The job of a Senior Software Engineer is really important in the tech world today. As more companies need advanced apps and services, they’re looking for skilled Senior Software Engineers more than ever.\r\nA Senior Software Engineer is an experienced software development professional who takes on complex programming tasks, designs software systems, oversees the technical aspects of projects, mentors junior engineers, and contributes to strategic planning. This role combines deep technical expertise with leadership responsibilities to guide the development of software solutions that meet organizational goals.",
      "email": "tata.software.engineer@gmail.com",
      "id": 5,
      "link": "https://www.software.engineer.com",
      "location": "Delhi",
      "recruiter": "Ronald",
      "title": "Senior Software Engineer"
    }
  ]
}